In [158]:
import pandas as pd
from matplotlib import pyplot as plt
import numpy as np
from random import sample

In [159]:
data = pd.read_excel("rand_data_50.xlsx")
data.head()

,First Name,Last Name,Gender,Age,Email,Phone,Education,Occupation,Experience (Years),Salary,Marital Status
0,Adelaide,Hall,Female,30,a.hall@randatmail.com,430-6243-60,Bachelor,Social Worker,9,969,Single
1,Sam,Parker,Male,24,s.parker@randatmail.com,034-7303-30,Bachelor,Geologist,4,9364,Married
2,Haris,Ellis,Male,29,h.ellis@randatmail.com,400-0278-05,Upper secondary,Accountant,14,2119,Married
3,Sawyer,Myers,Male,28,s.myers@randatmail.com,008-9970-47,Bachelor,Engineer,4,970,Single
4,Florrie,Andrews,Female,18,f.andrews@randatmail.com,642-1556-14,Bachelor,Firefighter,0,6546,Married

In [160]:
#adjusting to kumu's interpreter
data.rename(columns={"First Name": "Label", "Occupation": "Type"},inplace = True)

In [161]:
#just to visualize
a =  data.value
print(a[0])

['Adelaide' 'Hall' 'Female' 30 'a.hall@randatmail.com' '430-6243-60'
 'Bachelor' 'Social Worker' 9 969 'Single']

In [162]:
#creating a list of names
names = data['Label'].tolist()
print(mylist)

['Adelaide', 'Sam', 'Haris', 'Sawyer', 'Florrie', 'Brooke', 'Adrian', 'Daisy', 'Valeria', 'Oliver', 'Catherine', 'George', 'Naomi', 'Rebecca', 'David', 'April', 'Thomas', 'Briony', 'Carl', 'Spike', 'Fiona', 'John', 'Justin', 'Maximilian', 'Tony', 'Amelia', 'Sarah', 'Marcus', 'Max', 'Alissa', 'Naomi', 'Ryan', 'Ted', 'Dainton', 'Kelvin', 'Ada', 'Patrick', 'Adison', 'Sydney', 'Sarah', 'Abraham', 'Eleanor', 'Natalie', 'Sofia', 'Frederick', 'Amelia', 'Carlos', 'Ryan', 'Bruce', 'John']

In [163]:
#generating a random a list of names and the "type" of connection
randNames = sample(names, len(names))
mode = ["Pesonal" for i in range(len(names))]

#generating the dataFrame
connections_data = pd.DataFrame(
    {'From': names,'To': randNames,'Type': mode})
connections_data.head()

       From       To     Type
0  Adelaide     John  Pesonal
1       Sam  Eleanor  Pesonal
2     Haris   Justin  Pesonal
3    Sawyer    Sarah  Pesonal
4   Florrie    David  Pesonal

In [164]:
#writing a new the excel file
path = r"updated_50.xlsx"
writer = pd.ExcelWriter(path, engine = 'xlsxwriter')

#generating the two necessary sheets
data.to_excel(writer, sheet_name = 'Elements',index=False)
connections_data.to_excel(writer, sheet_name = 'Connections',index=False)

writer.save()
writer.close()